{
  "bounds": {
    "minX": -6,
    "maxX": 8,
    "minZ": -6,
    "maxZ": 6
  },
  "gridSize": 0.5,
  "grid": [
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    1,
    0,
    0,
    0,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    0,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    0,
    1,
    1,
    0,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    0,
    1,
    0,
    0,
    0,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    1,
    0,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    1,
    0,
    0,
    0,
    0,
    0,
    -1,
    -1,
    -1,
    -1,
    -1,
    -1,
    -1,
    0,
    -1,
    -1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    -1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    1,
    1,
    1,
    -1,
    0,
    -1,
    0,
    -1,
    -1,
    -1,
    -1,
    -1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    1,
    1,
    1,
    -1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    0,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    1,
    1,
    1,
    1,
    -1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    0,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    1,
    1,
    1,
    1,
    -1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    0,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    -1,
    1,
    1,
    1,
    1,
    -1,
    0,
    0,
    0,
    0,
    0,
    0,
    -1,
    1,
    0,
    0,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    0,
    0,
    0,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    1,
    1,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0
  ],
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              2
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 8,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightSpecs": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        2,
        16
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense1/bias",
      "shape": [
        16
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense2/kernel",
      "shape": [
        16,
        8
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense2/bias",
      "shape": [
        8
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense3/kernel",
      "shape": [
        8,
        1
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense3/bias",
      "shape": [
        1
      ],
      "dtype": "float32"
    }
  ],
  "weightData": "qvD7vW66Hz+uvnU/RvaAv4BbsMA2E5G/LKSgPkOvqL5B33s/gdq5PyUVfLl+twe9GoGgwJgAPj8ZoWg/5TDOvRCmA8BRGB++xuxHwL//3D+vIby/5mqnP//g6L3tOA8/S+69P3T0lj81QJA7wjvsvzuggz/Kwsu/U4YXwFof2b6qHZrAcGbSvYx8r7sgoJs/Dqypv/Q0qr/mBQnATx4ivmyDgcB4ioXAd9Q2vU8lh8D4tF2/QxeTvwDhW8BiQ3I/guq8QBd2pb7I5Ew+E8nyQHU7PL67Cr5AKNy/QFydbr8ayTc/ZqCrvlLZSb/L8J09y5/YvgarhT7UTsc8JhnQwDzd+DzBnKq+0jChP+igMr4QXgu9dzvXPARwAUCBHPrAfOuvP69qi77T2rM/Qye8PiSi3b52s6/Ag5gzP8qEET+dv+K9EoVcvvIDsMCDG5q+5mbLvvMRzT5tEnrAIGsrP1XyvL+vDyc+hfTCPxjJ87z1aEA93FjEP+HhQj9b2aY/AtdRPXaG1b1M/LW+U2DDvtYe1r7Yd1A/zacTv7/FNL+KW14/asxAvSQ1FD9/4im+2He1PvcTrb/USK29UUYKP4GqpcA5fmc+jUaWv4MPAcCFuUq++dm9PxwGTMAnnMe/KiIRv+74Ib/yyBDAJkIZv5UTjLx0/L8//XXNv9tepcCdvqS+wlUBPKa+F7/aHa+6otqmvf/kFT6u8WG+Zwv+vkq74z+jygK+ftCewAy1DEAN7ba+dXK5PxSmwr/HEf+/X7yCvyH0Pz6x8xXA8UZ1v5YsPL2tiww+gc8twPKxjL7N2eA+NYNMPm595T6CFOI+ONRJPnHrwT1Z8g4/g3V0v0W9MD9+3sq+fuVHwNf8pT+5Dne+rGE6QI+D0L+leqm/lMTqv6v5rT093lM96Ovxv3QJBL63n/G+433TPgb8Yz8Cice81iASvimZDUC1WknAxc4cvlCjgcANVixA0LA9O8u9qT75jZW+4OCrP6J87z5BWzK/Mqj0PvQrVz8w1V+/3/NZwA==",
  "trainingData": [
    {
      "input": [
        1,
        0
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.0681297554099844,
        0.1880381249315567
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.1362595108199687,
        0.3760762498631134
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.204389266229953,
        0.56411437479467
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.2725190216399371,
        0.7521524997262266
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.3406487770499214,
        0.9401906246577834
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.4087785324599056,
        1.12822874958934
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.4769082878698898,
        1.3162668745208967
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.5450380432798743,
        1.5043049994524536
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6131677986898587,
        1.6923431243840104
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6336002044259277,
        1.8801555907272998
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6324393697352566,
        2.0665915354056645
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6314823180370641,
        2.250826670289666
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.630830743876818,
        2.432353382925572
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6306724429750727,
        2.6105249480974884
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6313362547927233,
        2.784521623530914
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6334153423538802,
        2.953318643631743
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.63800675738585,
        3.1156715218985194
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6468144079499782,
        3.270148025964406
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6638981874226286,
        3.4152384306151253
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6962687468568807,
        3.5496894202470504
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.7560049328203935,
        3.6729961738093015
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.7855000968858519,
        3.7202612591908166
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.7853751565892608,
        3.734445090122954
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        2.204289026085879,
        4.007412432388234
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        1.6122491547740212,
        3.634308246276797
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.4391231529587813,
        3.53417140243064
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.2659971511435415,
        3.434034558584483
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.0928711493283019,
        3.333897714738326
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.9197451475130622,
        3.2337608708921692
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.7466191456978226,
        3.1336240270460123
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.5734931438825829,
        3.0334871831998553
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.4003671420673432,
        2.9333503393536984
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.22724114025210346,
        2.8332134955075414
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.05411513843686375,
        2.7330766516613845
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315435955822,
        2.6329398078152275
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.0774031502585688,
        2.540078230225566
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315360816,
        2.5332433189828456
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        -0.5771110932357998,
        2.5161560408760453
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        -0.0774031569577512,
        2.3859759888362184
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315285676178,
        2.242001940171098
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315620635298,
        2.101501033438858
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315210536365,
        1.9646500720742317
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315545495495,
        1.8316199352738813
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315135396562,
        1.7025724880120552
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315470355692,
        1.5776573759446872
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.0774031506025676,
        1.4570088321825818
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.0774031539521589,
        1.3407426472140995
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.0774031573017502,
        1.2289534538507776
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315320076087,
        1.12171247857192
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315655035217,
        1.019065884345449
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315244936284,
        0.9210337976744932
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315579895414,
        0.8276100704756101
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315169796481,
        0.7387627737392402
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315504755611,
        0.6544353785869564
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315094656679,
        0.5745485332893204
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315429615809,
        0.4990023208691887
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315019516876,
        0.427678858857011
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315354476006,
        0.3604451045574032
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315689435136,
        0.2971557310678024
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315279336203,
        0.23765596075304424
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315614295333,
        0.18178426031316833
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.077403152041964,
        0.1293748273300196
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.0774031553915553,
        0.08025982288624167
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        -0.5620919494806574,
        -0.04252768822320312
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        0.11548273598973517,
        0.02739175212472246
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.30836862737102577,
        -0.025476318636796752
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.5012545187523163,
        -0.07834438939831596
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.6941404101336068,
        -0.13121246015983518
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.8870263015148975,
        -0.1840805309213544
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.0799121928961881,
        -0.2369486016828736
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.2727980842774789,
        -0.2898166724443928
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.4656839756587694,
        -0.342684743205912
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.65856986704006,
        -0.39555281396743125
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.8514557584213507,
        -0.4484208847289505
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.044341649802641,
        -0.5012889554904697
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.2372275411839317,
        -0.5541570262519889
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.4301134325652223,
        -0.6070250970135082
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.622999323946513,
        -0.6598931677750274
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.8158852153278033,
        -0.7127612385365466
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.008771106709094,
        -0.7656293092980658
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.201656998090385,
        -0.8184973800595851
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.3945428894716754,
        -0.8713654508211043
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.5874287808529655,
        -0.9242335215826235
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.7803146722342555,
        -0.9771015923441427
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.9732005636155456,
        -1.0299696631056618
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.166086454996836,
        -1.082837733867181
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.358972346378126,
        -1.1357058046287003
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.551858237759416,
        -1.1885738753902195
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.744744129140706,
        -1.2414419461517388
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.937630020521996,
        -1.294310016913258
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.130515911903286,
        -1.3471780876747772
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.323401803284576,
        -1.4000461584362964
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.516287694665866,
        -1.4529142291978157
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.709173586047156,
        -1.5057822999593349
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.9020594774284465,
        -1.5586503707208539
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.094945368809737,
        -1.6115184414823729
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.287831260191028,
        -1.664386512243892
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.480717151572318,
        -1.717254583005411
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.423779792303344,
        -1.9089787002141645
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.366842433034371,
        -2.100702817422918
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.309905073765398,
        -2.2924269346316715
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.252967714496425,
        -2.484151051840425
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.196030355227451,
        -2.6758751690491787
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.139092995958478,
        -2.8675992862579323
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.082155636689505,
        -3.059323403466686
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        6.025218277420532,
        -3.2510475206754395
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.968280918151558,
        -3.442771637884193
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.911343558882586,
        -3.6344957550929466
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.854406199613613,
        -3.8262198723017002
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.7974688403446395,
        -4.017943989510454
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.740531481075665,
        -4.209668106719207
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.683594121806692,
        -4.401392223927961
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.63317862480365,
        -4.207850813211969
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.582763127800607,
        -4.014309402495978
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.532347630797565,
        -3.8207679917799866
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.481932133794522,
        -3.6272265810639954
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.431516636791479,
        -3.4336851703480042
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.381101139788436,
        -3.240143759632013
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.330685642785394,
        -3.046602348916022
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.280270145782351,
        -2.8530609382000307
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.229854648779308,
        -2.6595195274840395
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.179439151776266,
        -2.465978116768048
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.129023654773222,
        -2.2724367060520563
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.07860815777018,
        -2.0788952953360647
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.028192660767137,
        -1.885353884620073
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.977777163764094,
        -1.6918124739040814
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.927361666761051,
        -1.4982710631880898
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.876946169758008,
        -1.3047296524720982
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.8265306727549655,
        -1.1111882417561065
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.776115175751922,
        -0.9176468310401149
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.725699678748879,
        -0.7241054203241233
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.675284181745837,
        -0.5305640096081317
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.624868684742793,
        -0.3370225988921401
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.57445318773975,
        -0.14348118817614847
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.524037690736706,
        0.05006022253984316
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.4736221937336635,
        0.24360163325583478
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.4257693271735326,
        0.25461524872756996
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        4.299730584665925,
        0.738468775517549
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        4.23642140399414,
        0.19021521776755496
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.047073480814748,
        0.12581518680753997
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.8577255576353555,
        0.061415155847524994
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.6683776344559633,
        -0.0029848751124900014
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.479029711276571,
        -0.06738490607250498
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.2896817880971785,
        -0.13178493703251998
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.100333864917786,
        -0.19618496799253496
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.910985941738393,
        -0.26058499895254994
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.7216380185590006,
        -0.3249850299125649
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.532290095379608,
        -0.38938506087257996
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.3429421722002157,
        -0.453785091832595
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.189588705416287,
        -0.5821701152011736
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.036235238632358,
        -0.710555138569752
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.882881771848429,
        -0.8389401619383305
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.7295283050645,
        -0.967325185306909
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.5761748382805714,
        -1.0957102086754875
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.4228213714966425,
        -1.224095232044066
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.2694679047127135,
        -1.3524802554126445
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.1161144379287846,
        -1.480865278781223
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.9627609711448557,
        -1.6092503021498017
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.8094075043609269,
        -1.7376353255183803
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.6560540375769981,
        -1.866020348886959
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.5027005707930693,
        -1.9944053722555375
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.34934710400914043,
        -2.1227903956241163
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.1959936372252116,
        -2.251175418992695
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.04264017044128271,
        -2.379560442361274
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.08685321629677262,
        -2.5103268781014796
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.13032730602461323,
        -2.6567609827985463
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.2866047263545798,
        -2.781570308952528
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.44288214668454634,
        -2.9063796351065094
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.5991595670145129,
        -3.031188961260491
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.7554369873444795,
        -3.1559982874144725
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.9117144076744461,
        -3.280807613568454
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.0679918280044127,
        -3.4056169397224356
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.2242692483343793,
        -3.530426265876417
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.380546668664346,
        -3.6552355920303987
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.5368240889943126,
        -3.7800449181843803
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.693101509324279,
        -3.904854244338362
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.8493789296542458,
        -4.029663570492344
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.0056563499842124,
        -4.154472896646326
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.161933770314179,
        -4.279282222800308
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.3182111906441456,
        -4.40409154895429
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.474488610974112,
        -4.528900875108272
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.630766031304079,
        -4.653710201262254
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.787043451634046,
        -4.778519527416236
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.9433208719640125,
        -4.903328853570218
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.099598292293979,
        -5.028138179724199
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.255875712623946,
        -5.152947505878181
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.3065505414353393,
        -4.959473833961468
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.357225370246733,
        -4.7660001620447545
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.4079001990581266,
        -4.572526490128041
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.45857502786952,
        -4.379052818211328
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.5092498566809134,
        -4.185579146294614
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.5599246854923075,
        -3.9921054743779014
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.610599514303701,
        -3.7986318024611885
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.6612743431150947,
        -3.6051581305444755
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.7119491719264883,
        -3.4116844586277626
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.7626240007378815,
        -3.2182107867110497
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.8132988295492756,
        -3.0247371147943367
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.8639736583606688,
        -2.8312634428776238
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.9146484871720615,
        -2.788203225124103
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.9640879433935328,
        -2.7882033101049086
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        -4.087686583947212,
        -2.303720724191563
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        -3.765154746982536,
        -2.7882033950857257
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.5662671435532247,
        -2.7882032416479636
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.3674280987009952,
        -2.7882033266287807
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -3.1686408402052697,
        -2.7882034116095613
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.9699088855615816,
        -2.788203258171763
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.771236074992898,
        -2.7882033431525426
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.5726266110341984,
        -2.7882034281333223
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.3740850997549408,
        -2.788203274695523
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -2.175616599956805,
        -2.788203359676267
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.9772266819802458,
        -2.788203206238432
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.7789214900463264,
        -2.7882032912191757
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.5807078207725533,
        -2.7882033761999194
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.382593208316539,
        -2.788203222762084
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -1.1845860259994083,
        -2.788203307742827
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.9866956079867553,
        -2.788203392723533
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.7889323859261174,
        -2.7882032392856595
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.5913080527476637,
        -2.788203324266365
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.39274567188945647,
        -2.783035860201242
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.19541366451513,
        -2.750477007862458
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.0019183428591964535,
        -2.7179181555236736
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.1992503502335229,
        -2.6853593031848892
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.3965823576078493,
        -2.652800450846105
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.5939143649821759,
        -2.6202415985073206
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.7912463723565024,
        -2.5876827461685363
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.9885783797308288,
        -2.555123893829752
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.1859103871051553,
        -2.5225650414909677
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.3832423944794818,
        -2.4900061891521834
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.5805744018538082,
        -2.457447336813399
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.7779064092281347,
        -2.424888484474615
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.9752384166024612,
        -2.3923296321358305
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.1725704239767873,
        -2.359770779797046
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.3699024313511137,
        -2.327211927458262
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.5672344387254404,
        -2.2946530751194776
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.7645664460997668,
        -2.2620942227806933
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.961898453474093,
        -2.229535370441909
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.1592304608484194,
        -2.1969765181031247
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.356562468222746,
        -2.1644176657643404
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.553894475597072,
        -2.131858813425556
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.7512264829713984,
        -2.0992999610867713
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.9485584903457247,
        -2.066741108747987
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.1458904977200515,
        -2.0341822564092022
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.343222505094378,
        -2.0016234040704175
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.540554512468704,
        -1.9690645517316332
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.73788651984303,
        -1.9365056993928484
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.935218527217358,
        -1.9039468470540641
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.132550534591684,
        -1.8713879947152794
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.163395785610004,
        -1.6737808832804508
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.194241036628325,
        -1.4761737718456223
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.225086287646646,
        -1.2785666604107937
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.255931538664966,
        -1.0809595489759651
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.286776789683287,
        -0.8833524375411365
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.317622040701608,
        -0.6857453261063078
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.3484672917199285,
        -0.48813821467147916
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.3793125427382495,
        -0.2905311032366505
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.410157793756571,
        -0.09292399180182176
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.441003044774891,
        0.10468311963300692
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.472397877959064,
        0.2631452886841307
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.505731000026693,
        0.2634169424770995
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        5.582135947584635,
        0.757544743747852
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        5.315091602655288,
        0.20294694851424774
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        5.124452205283883,
        0.14247695455139597
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.933812807912478,
        0.0820069605885442
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.743173410541073,
        0.021536966625692433
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.552534013169668,
        -0.03893302733715932
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.361894615798262,
        -0.0994030213000111
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        4.171255218426856,
        -0.15987301526286285
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.98061582105545,
        -0.22034300922571462
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.7899764236840445,
        -0.2808130031885664
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.5993370263126394,
        -0.3412829971514182
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.4086976289412343,
        -0.40175299111426993
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.218058231569829,
        -0.4622229850771217
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        3.0274188341984236,
        -0.5226929790399734
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.836779436827018,
        -0.5831629730028252
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.6461400394556125,
        -0.643632966965677
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.455500642084207,
        -0.7041029609285288
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.264861244712802,
        -0.7645729548913806
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.0742218473413963,
        -0.8250429488542323
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.883582449969991,
        -0.8855129428170841
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6929430525985856,
        -0.945982936779936
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.5023036552271798,
        -1.0064529307427876
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.3116642578557742,
        -1.0669229247056393
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.1210248604843687,
        -1.127392918668491
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.9303854631129631,
        -1.1878629126313427
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.7397460657415574,
        -1.2483329065941944
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.5491066683701519,
        -1.308802900557046
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.35846727099874637,
        -1.3692728945198978
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.1678278736273408,
        -1.4297428884827494
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.022811523744064754,
        -1.4902128824456011
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315302253482,
        -1.5506828764084528
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315637212612,
        -1.6095579923931755
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.0774031522711367,
        -1.666237254693239
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.0774031556207279,
        -1.7207812838831857
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315151973857,
        -1.773251306634905
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315486932987,
        -1.8237088734446227
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        -0.07740315076834055,
        -1.8722156003006007
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        -0.5624746496844769,
        -1.9934824174405454
      ],
      "output": [
        0
      ]
    },
    {
      "input": [
        0.08417321006196447,
        -1.7543466916739614
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.2457495708922695,
        -1.636477783047322
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.4073259317225746,
        -1.5186088744206827
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.5689022925528796,
        -1.4007399657940434
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.7304786533831846,
        -1.282871057167404
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        0.8920550142134896,
        -1.1650021485407647
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.053631375043795,
        -1.0471332399141253
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.2152077358740998,
        -0.929264331287486
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.3767840967044047,
        -0.8113954226608466
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.5383604575347096,
        -0.6935265140342073
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.6999368183650148,
        -0.5756576054075678
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        1.8615131791953194,
        -0.4577886967809283
      ],
      "output": [
        1
      ]
    },
    {
      "input": [
        2.023089540025625,
        -0.3399197881542888
      ],
      "output": [
