{"bounds":{"minX":-7,"maxX":24,"minZ":-7,"maxZ":7},"gridSize":0.5,"grid":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,2],"dtype":"float32"}},{"class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightSpecs":[{"name":"dense_Dense1/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[1],"dtype":"float32"}],"weightData":"8tdsPnsRKr5xtTs/F7iZPmVrUz7nV5q++QAPOnJm1D5jIjk/kq7tO6DDhT0AYHM+mriBvlr1xr2yE7G8r23Qvpsgnj4sA7O+t6rMPqT+2r4RCeW9BzTMvZvHqD59oD8/pyYCP8UvBb6aybe+2J8BP46H1j6PORc+7JJBvkG6+70R+i0+AAAAAPQKIj40Ce89HWS0vQAAAACN60Y+6G0iPgMvKz7O2Rs6dVwMPOnaEz6uiRY+08W4vetAbr0AAAAA2kYhvj5Wnz7pKsU+UqU9PxzjCj5nFoS9VAz5Pjyxwj5t1ls9Xv7Yvi3mTj6uYsQ9GogvPmeyjz4oTbY8u4BWvvg61z7bWM08SSRQPgS65D7bycw8S+XFvsVsWD42WhI+YCeEPpT55z3cSIo+o37kPrQYzL7ZYxk9vvMUvmZNTz1lX6I+c53LPdGPGr6vMro8DqLqPeeuMr6XlVS+zuiqvkm/Vr7Nx64+R0sGvhzs1j51k3e92ZAnPjJVlr2tV2m9xIi1PptOyz7kXs0+NVOEPXocCL5LRCu+JMnpPiGstz2C0GA+ZGw9PwzXE76Y0jc+Km8Gvq7QIb7LvPM+aT6gvtxgnT3oD8w+puiFvpDZ5D6RwV29ALfWvvMfJj4HLok9vjnjvmG15L6mR5I+xrsCP+nQFzz/12c+jiawPpLxFL2pa7g9xrqWPi4b17z8lyQ+5spoPutd1T20XLe+akyhvrto4j6CIv4+NIfmvrJfs742SNe+1nqjvj2V1D4H4RG/Ei4sPj0YXz5Cvwg+gE6tPVe+4z0vrgi9Alt+Ph7lTTwpQNE+wmKhPjtE6j2ChRU9TffkvQls0z6zxNK+A72GvlPx7z1L7Z0+Osh/vkqImr1/ke093qq6PsnODr2nqbW+dzyRvJuliL2m6PG+AonPvoPVtr5p504+CtcUvnjHCz5JYxU+gdghPhMobr2stRY+iiBzvQAAAAArJhc+CDqYvFqbKj+lt3o+c1E6vw30BT8hS9y+tLdRPoXwAz82LBi/0vkRPg==","trainingData":[{"input":[0.1883483823189675,3.9327327206003684],"output":[1]},{"input":[0.376696764637935,3.865465441200737],"output":[1]},{"input":[0.5650451469569026,3.798198161801106],"output":[1]},{"input":[0.75339352927587,3.7309308824014744],"output":[1]},{"input":[0.9417419115948376,3.6636636030018432],"output":[1]},{"input":[1.130090293913805,3.5963963236022116],"output":[1]},{"input":[1.3184386762327727,3.52912904420258],"output":[1]},{"input":[1.50678705855174,3.461861764802949],"output":[1]},{"input":[1.6951354408707076,3.394594485403317],"output":[1]},{"input":[1.8834838231896749,3.327327206003686],"output":[1]},{"input":[2.0718322055086427,3.2600599266040544],"output":[1]},{"input":[2.26018058782761,3.192792647204423],"output":[1]},{"input":[2.4485289701465778,3.1255253678047916],"output":[1]},{"input":[2.6368773524655453,3.05825808840516],"output":[1]},{"input":[2.825225734784513,2.9909908090055284],"output":[1]},{"input":[3.0135741171034804,2.923723529605897],"output":[1]},{"input":[3.2019224994224476,2.8564562502062656],"output":[1]},{"input":[3.3902708817414147,2.7891889708066344],"output":[1]},{"input":[3.5786192640603818,2.7219216914070032],"output":[1]},{"input":[3.7669676463793493,2.654654412007372],"output":[1]},{"input":[3.9553160286983164,2.587387132607741],"output":[1]},{"input":[4.1436644110172836,2.5201198532081097],"output":[1]},{"input":[4.332012793336251,2.4528525738084785],"output":[1]},{"input":[4.520361175655218,2.3855852944088474],"output":[1]},{"input":[4.708709557974185,2.318318015009216],"output":[1]},{"input":[4.897057940293152,2.251050735609585],"output":[1]},{"input":[5.085406322612119,2.183783456209954],"output":[1]},{"input":[5.273754704931086,2.1165161768103227],"output":[1]},{"input":[5.462103087250053,2.0492488974106915],"output":[1]},{"input":[5.546500004116355,1.9819816180110605],"output":[1]},{"input":[5.546499605003653,1.9154494706282401],"output":[1]},{"input":[5.5464996827281094,1.8502423521929976],"output":[1]},{"input":[5.546499760452566,1.7863432617639996],"output":[1]},{"input":[5.546499838177022,1.72373488245443],"output":[1]},{"input":[5.546499915901478,1.6623996118829534],"output":[1]},{"input":[5.546499993625934,1.6023195952109746],"output":[1]},{"input":[5.546499594513232,1.5434767572764398],"output":[1]},{"input":[5.5464996722376885,1.4858528367313402],"output":[1]},{"input":[5.546499749962145,1.4294294071040512],"output":[1]},{"input":[5.546499827686601,1.3741879149958425],"output":[1]},{"input":[5.546499905411057,1.3201097048774737],"output":[1]},{"input":[5.546499983135513,1.2671760458152228],"output":[1]},{"input":[5.546499584022811,1.2153681570066817],"output":[1]},{"input":[5.5464996617472675,1.1646672347867686],"output":[1]},{"input":[5.555555931846694,1.0955681236838255],"output":[1]},{"input":[5.593892980726436,0.9972615153958876],"output":[1]},{"input":[5.6957525611252136,0.8821491424941338],"output":[1]},{"input":[5.813935056988665,0.7727917248707501],"output":[1]},{"input":[6.009403912477064,0.7304605716375192],"output":[1]},{"input":[6.204872767965464,0.6881294184042884],"output":[1]},{"input":[6.400341623453863,0.6457982651710578],"output":[1]},{"input":[6.595810478942262,0.6034671119378271],"output":[1]},{"input":[6.791279334430661,0.5611359587045964],"output":[1]},{"input":[6.98674818991906,0.5188048054713658],"output":[1]},{"input":[7.182217045407459,0.4764736522381351],"output":[1]},{"input":[7.377685900895857,0.4341424990049044],"output":[1]},{"input":[7.573154756384255,0.3918113457716737],"output":[1]},{"input":[7.768623611872655,0.349480192538443],"output":[1]},{"input":[7.964092467361054,0.3071490393052123],"output":[1]},{"input":[8.159561322849452,0.26481788607198165],"output":[1]},{"input":[8.355030178337852,0.22248673283875092],"output":[1]},{"input":[8.550499033826252,0.1801555796055202],"output":[1]},{"input":[8.745967889314652,0.13782442637228948],"output":[1]},{"input":[8.94143674480305,0.09549327313905878],"output":[1]},{"input":[9.136905600291449,0.0531621199058281],"output":[1]},{"input":[9.332374455779847,0.010830966672597413],"output":[1]},{"input":[9.527843311268246,-0.031500186560633255],"output":[1]},{"input":[9.723312166756644,-0.07383133979386391],"output":[1]},{"input":[9.918781022245044,-0.11616249302709455],"output":[1]},{"input":[10.114249877733444,-0.15849364626032522],"output":[1]},{"input":[10.309718733221844,-0.20082479949355586],"output":[1]},{"input":[10.505187588710243,-0.24315595272678653],"output":[1]},{"input":[10.700656444198641,-0.2854871059600172],"output":[1]},{"input":[10.89612529968704,-0.32781825919324786],"output":[1]},{"input":[11.091594155175438,-0.37014941242647853],"output":[1]},{"input":[11.287063010663838,-0.4124805656597092],"output":[1]},{"input":[11.482531866152236,-0.4548117188929398],"output":[1]},{"input":[11.678000721640634,-0.4971428721261704],"output":[1]},{"input":[11.873469577129034,-0.539474025359401],"output":[1]},{"input":[12.068938432617433,-0.5818051785926317],"output":[1]},{"input":[12.264407288105833,-0.6241363318258623],"output":[1]},{"input":[12.459876143594231,-0.6664674850590929],"output":[1]},{"input":[12.655344999082631,-0.7087986382923235],"output":[1]},{"input":[12.85081385457103,-0.7511297915255541],"output":[1]},{"input":[13.046282710059428,-0.7934609447587847],"output":[1]},{"input":[13.241751565547828,-0.8357920979920153],"output":[1]},{"input":[13.437220421036226,-0.8781232512252458],"output":[1]},{"input":[13.632689276524626,-0.9204544044584763],"output":[1]},{"input":[13.436557476175576,-0.8813095849820798],"output":[1]},{"input":[13.240425675826526,-0.8421647655056833],"output":[1]},{"input":[13.044293875477475,-0.8030199460292868],"output":[1]},{"input":[12.848162075128425,-0.7638751265528902],"output":[1]},{"input":[12.652030274779374,-0.7247303070764937],"output":[1]},{"input":[12.455898474430324,-0.6855854876000972],"output":[1]},{"input":[12.259766674081272,-0.6464406681237007],"output":[1]},{"input":[12.06363487373222,-0.6072958486473042],"output":[1]},{"input":[11.867503073383169,-0.5681510291709079],"output":[1]},{"input":[11.671371273034119,-0.5290062096945114],"output":[1]},{"input":[11.475239472685068,-0.4898613902181149],"output":[1]},{"input":[11.279107672336018,-0.4507165707417185],"output":[1]},{"input":[11.082975871986967,-0.4115717512653221],"output":[1]},{"input":[10.886844071637915,-0.3724269317889256],"output":[1]},{"input":[10.690712271288863,-0.33328211231252913],"output":[1]},{"input":[10.49458047093981,-0.29413729283613266],"output":[1]},{"input":[10.298448670590759,-0.25499247335973624],"output":[1]},{"input":[10.102316870241706,-0.2158476538833398],"output":[1]},{"input":[9.906185069892654,-0.17670283440694334],"output":[1]},{"input":[9.710053269543602,-0.13755801493054692],"output":[1]},{"input":[9.51392146919455,-0.09841319545415049],"output":[1]},{"input":[9.317789668845498,-0.059268375977754056],"output":[1]},{"input":[9.121657868496445,-0.020123556501357623],"output":[1]},{"input":[8.925526068147393,0.01902126297503881],"output":[1]},{"input":[8.729394267798341,0.05816608245143523],"output":[1]},{"input":[8.533262467449289,0.09731090192783166],"output":[1]},{"input":[8.337130667100237,0.13645572140422813],"output":[1]},{"input":[8.140998866751184,0.17560054088062457],"output":[1]},{"input":[7.944867066402132,0.214745360357021],"output":[1]},{"input":[7.748735266053081,0.25389017983341744],"output":[1]},{"input":[7.552603465704029,0.29303499930981386],"output":[1]},{"input":[7.356471665354976,0.33217981878621033],"output":[1]},{"input":[7.160339865005924,0.37132463826260675],"output":[1]},{"input":[6.964208064656873,0.4104694577390032],"output":[1]},{"input":[6.768076264307821,0.4496142772153996],"output":[1]},{"input":[6.5719444639587685,0.48875909669179607],"output":[1]},{"input":[6.375812663609716,0.5279039161681924],"output":[1]},{"input":[6.179680863260665,0.5670487356445889],"output":[1]},{"input":[5.983549062911613,0.6061935551209854],"output":[1]},{"input":[5.787417262562561,0.6453383745973819],"output":[1]},{"input":[5.591285462213509,0.6844831940737782],"output":[1]},{"input":[5.395153661864457,0.7236280135501747],"output":[1]},{"input":[5.199021861515406,0.7627728330265712],"output":[1]},{"input":[5.002890061166354,0.8019176525029676],"output":[1]},{"input":[4.806758260817301,0.8410624719793641],"output":[1]},{"input":[4.610626460468249,0.8802072914557606],"output":[1]},{"input":[4.414494660119197,0.9193521109321572],"output":[1]},{"input":[4.218362859770145,0.9584969304085538],"output":[1]},{"input":[4.022231059421093,0.9976417498849504],"output":[1]},{"input":[3.826099259072041,1.0367865693613467],"output":[1]},{"input":[3.6299674587229886,1.075931388837743],"output":[1]},{"input":[3.433835658373937,1.1150762083141397],"output":[1]},{"input":[3.2377038580248847,1.1542210277905363],"output":[1]},{"input":[3.041572057675833,1.1933658472669328],"output":[1]},{"input":[2.8454402573267807,1.2325106667433292],"output":[1]},{"input":[2.649308456977729,1.2716554862197256],"output":[1]},{"input":[2.453176656628677,1.3108003056961222],"output":[1]},{"input":[2.257044856279625,1.3499451251725185],"output":[1]},{"input":[2.0609130559305733,1.3890899446489149],"output":[1]},{"input":[1.8647812555815217,1.4282347641253113],"output":[1]},{"input":[1.6686494552324702,1.4673795836017076],"output":[1]},{"input":[1.4725176548834187,1.506524403078104],"output":[1]}]}